# СГЕНЕРИРУЙТЕ список А из всех чисел от 1 до 20.

# Пользователь вводит строки в переменные S1 и S2.
# Необходимо СГЕНЕРИРОВАТЬ списки из всех букв строк соответственно. 
# Соедините получившиеся списки в новый, выведите его на экран и укажите сколько в нём элементов.

# Необходимо СГЕНЕРИРОВАТЬ список, состоящий из элементов списка А умноженных на 3.

# Дан список  s = [10, -5, -15, 1, -42, 31] и список о = [22, -8, 44, 101, -4, 8] Необходимо СГЕНЕРИРОВАТЬ:
# Список, состоящий из суммы элементов списков s и о.
# Список, состоящий из произведения элементов списков s и о.
# Список, состоящий из положительных элементов списков s и о.
# Список, состоящий из отрицательных элементов списков s и о.
# Список, состоящий из отрицательных элементов списка s и положительных элементов списка о.

# Используя списочные выражения создайте и выведите на экран
# Вариант 12

A = [i for i in range(1, 21)]
print(A)

S1 = input("Введите строку 1: ")
S2 = input("Введите строку 2: ")

list_S1 = list(S1)
list_S2 = list(S2)

new_list = list_S1 + list_S2
print(new_list)
print(len(new_list))

B = [i*3 for i in A]
print(B)

s = [10, -5, -15, 1, -42, 31]
o = [22, -8, 44, 101, -4, 8]

SUMM = [a + b for a in s for b in o]
MULT = [a * b for a in s for b in o]
POSI = [a for a in s + o if a >= 0]
NEGA = [a for a in s + o if a < 0]
WHAT = [a for a in s if a<0] + [b for b in o if b>=0]


