# Проходит турнир по танцам. Каждый участник имеет порядковый номер от 0 до 5. Турнир судят 4 тренера, каждый выставляет оценку от 1 до 10.
# Итоги конкурса записаны в двумерный список ( у вас он должен заполняться случайным образом) 
# А = [  [ 9, 9, 10, 8  ],
# [ 8, 7, 5, 5   ],
# [ 6, 4, 5, 8 ], 
# [ 10, 9, 10, 10  ],
#  	[ 9, 9, 10, 8 ],
# [ 7, 6, 8, 10  ], ]
# в этом списке каждая строчка соответствует участнику, а столбец - тренеру. Т.е. участник с номером 0 получил оценки [ 9, 9, 10, 8  ].
# Определите и запишите в новый ОДНОМЕРНЫЙ список Н итоговый балл (сумму всех оценок) каждого участника турнира. 
# Выведите номер и количество баллов участника, который победил (набрал больше всего баллов).
# Определите самого строго и самого лояльного члена жюри ( кто суммарно поставил минимальное количество баллов и максимальное соответственно). Выведите их порядковые номера на экран.

import random
A = [[random.randint(1,10) for i in range(4)] for j in range(6)]
print(A)

RESULTS = [sum(row) for row in A]
winner = RESULTS.index(max(RESULTS))
print(f'Участник номер {winner} победил с количеством баллов {max(RESULTS)}')

strictest = 0
loyallest = 0
min_sum = 999
max_sum = -999
for i in range(4):
    s = sum([row[i] for row in A])
    if s < min_sum:
        min_sum = s
        strictest = i
    if s > max_sum:
        max_sum = s
        loyallest = i
print(f'Самый строгий - {strictest}, самый лояльный - {loyallest}')
