import random

# Вариант 12

# Задание 1
# Используя конструкцию if-else-elif решите задачу своего варианта.
# Если число делится на 2, вывести "Чётное", если делится на 3 — "Делится на 3", если ни на одно, то "Не делится".

number = int(input("Введите число: "))
if number % 2 == 0:
    print("Чётное")
if number % 3 == 0:
    print("Делится на 3")
else:
    print("Не делится")

# Задание 2
# Используя конструкцию match-case решите задачу своего варианта.
# Программа должна классифицировать транспортные средства по их типу: легковой автомобиль, грузовик, автобус.

transport = input("Введите тип транспорта: ")
match transport:
    case "легковой автомобиль":
        print("Кузов легкового автомобиля составляет 240 см")
    case "грузовик":
        print("Кузов грузовика составляет 270 см")
    case "автобус":
        print("Кузов автобуса составляет 290 см")
    case _:
        print("Транспортного средства с таким типом не существует")

# Задание 3
# Используя конструкцию for решите задачу своего варианта.
# Напишите программу, которая находит все числа от 1 до N, которые являются квадратами целых чисел. Выведите все такие числа в порядке возрастания.

N = int(input("Введите значение для N: "))
for i in range(1, N + 1):
    root = int(i ** 0.5)
    if root * root == i:
        print(i)


# Задание 4
# Используя конструкцию while и continue с break решите задачу своего варианта. 
# Напишите программу, которая считывает числа от 1 до N и находит все числа, которые являются квадратами чётных чисел. Как только программа находит число, большее 100, она должна завершить выполнение.

n = int(input("Введите N: "))
i = 1
while i <= n:
    if i > 100:
        break
    if i % 2 == 0 and int(i**0.5)**2 == i:
        print(i, end=" ")
    i += 1


# Задание 5
# Используя все изученные конструкции, решите задачу своего варианта. 
# Напишите программу для игры "Камень, ножницы, бумага". Игрок выбирает одно из трёх действий, компьютер выбирает случайно. Программа должна объявить победителя, а затем спросить, хочет ли игрок сыграть ещё раз.

choice = input("\nВведите действие (камень, ножницы, бумага): ").lower()
computer_choice = random.choice(["камень", "ножницы", "бумага"])
print(f"Компьютер выбрал {computer_choice}")

if choice == computer_choice:
    print("Ничья")
elif (choice == "камень" and computer_choice == "ножницы") or \
     (choice == "ножницы" and computer_choice == "бумага") or \
     (choice == "бумага" and computer_choice == "камень"):
    print("Вы выиграли")
else:
    print("Вы проиграли")

# Задание 6
# Используя вложенные циклы решите задачу своего варианта. 
# Напишите программу, которая находит все возможные комбинации букв из строки длиной N.

string = input("Введите строку: ")
n = len(string)

for i in range(1, n + 1):
    for combination in range(2**n):
        current = ""
        for j in range(n):
            if (combination & (1 << j)):
                current += string[j]
        if len(current) == i:
            print(current)



# Задание 7
# Используя вложенные циклы решите задачу своего варианта. 
# Напишите программу, которая выводит все числа от 1 до N, которые можно представить как сумму двух чётных чисел.

N = int(input("Введите значение для N: "))

for i in range(1, N + 1):
    arr = []
    for x in range(2, i, 2):
        for y in range(2, i, 2):
            if x + y == i and (x, y) not in arr and (y, x) not in arr:
                arr.append((x, y))
    
    if arr:
        for pair in arr:
            print(f"{i} можно представить как сумму {pair[0]} и {pair[1]}")

