# Вариант 12

# Задание 1
# Дана строка, состоящая из русских слов, разделенных пробелами. Найти количество слов, которые начинаются и заканчиваются одинаковыми гласными.

# Список гласных букв
text = input("Введите строку для задания 1: ")
vowels = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
count = 0

# Разбиваем строку на слова и проверяем каждое слово
for word in text.split():
    if word and word[0].lower() in vowels and word[-1].lower() in vowels and word[0].lower() == word[-1].lower():
        count += 1

print(f"Количество слов, начинающихся и заканчивающихся одинаковыми гласными: {count}")

# Задание 2
# Дана строка, состоящая из русских слов, разделенных пробелами. Найти количество слов, которые содержат хотя бы одну «первую букву вашего отчества».

text = input("Введите строку для задания 2: ")
target_letter = 'В'
count = 0

for word in text.split():
    if target_letter.lower() in word.lower():
        count += 1

print(f"Количество слов, содержащих букву '{target_letter}': {count}")

# Задание 3
# Дана строка, состоящая из русских слов, разделенных пробелами. Найти количество слов длиной менее 5 символов.

text = input("Введите строку для задания 3: ")
count = sum(1 for word in text.split() if len(word) < 5)
print(f"Количество слов длиной менее 5 символов: {count}")

# Задание 4
# Переставить символы строки, такие что символы с нечетных позиций будут на четных, а с четных — на нечетных.

text = input("Введите строку для задания 4: ")
# Преобразуем строку в список для удобства замены
chars = list(text)
for i in range(0, len(chars)-1, 2):
    chars[i], chars[i+1] = chars[i+1], chars[i]
result = ''.join(chars)
print(f"Результат перестановки: {result}")

# Задание 5
# Дана строка, состоящая из русских слов, разделенных пробелами. Перевести строку в формат, где слова разделены символом *.

text = input("Введите строку для задания 5: ")
result = '*'.join(text.split())
print(f"Результат замены пробелов на *: {result}")

# Задание 6
# Дана строка с полным путем файла. Выделить только имя файла с расширением.

file_path = input("Введите полный путь к файлу для задания 6: ")
file_name = file_path.split('\\')[-1]  # Для Windows используем обратный слеш
print(f"Имя файла: {file_name}")

# Задание 7
# Заменить все гласные буквы на смайлик.

text = input("Введите строку для задания 7: ")
vowels = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
result = ''
for char in text:
    if char in vowels:
        result += ':)'
    else:
        result += char
print(f"Результат замены гласных на смайлики: {result}")

# Задание 8
# Даны две строки. Выведите строку, состоящую из символов первой строки, которые стоят на нечётных позициях и также присутствуют в второй строке.

str1 = input("Введите первую строку для задания 8: ")
str2 = input("Введите вторую строку для задания 8: ")
result = ''
for i in range(0, len(str1), 2):  # Перебираем нечетные позиции (индексы 0,2,4...)
    if str1[i] in str2:
        result += str1[i]
print(f"Результат: {result}")

# Задание 9
# Используя модуль Re, решите три задачи вашего варианта с регулярными выражениями.

import re

# Задача 1: Преобразование пробелов в подчеркивания, исключая email и URL
text = input("Введите текст с email и URL для задания 9.1: ")
# Сначала защищаем email и URL
protected = re.sub(r'(\S+@\S+\.\S+|https?://\S+)', lambda m: m.group().replace(' ', '###'), text)
# Заменяем пробелы на подчеркивания
result = re.sub(r'\s+', '_', protected)
# Возвращаем защищенные пробелы
result = result.replace('###', ' ')
print(f"Результат замены пробелов: {result}")

# Задача 2: Извлечение URL и разделение текста
text = input("Введите текст с URL для задания 9.2: ")
urls = re.findall(r'https?://\S+', text)
parts = re.split(r'https?://\S+', text)
print("Найденные URL:", urls)
print("Части текста:")
for i, part in enumerate(parts):
    print(f"Часть {i+1}: {part.strip()}")

# Задача 3: Замена хештегов
text = input("Введите текст с хештегами для задания 9.3: ")
# Находим все хештеги
hashtags = re.findall(r'#\w+', text)
print("Найденные хештеги:", hashtags)
# Заменяем хештеги
result = re.sub(r'#\w+', '#hashtag', text)
print(f"Текст с замененными хештегами: {result}")